Codigo-Fonte/implementacao/src/main/resources/consultarPosicaoEstoquePorCNESPrincipioAtivoPaginado

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:est="http://servicos.saude.gov.br/horus/v1r0/EstoqueService" xmlns:pag="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/paginacao">
 <soap:Header>
 <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wsswssecurity-secext-1.0.xsd">
 <wsse:UsernameToken wsu:Id="Id-0001334008436683-000000002c4a1908-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
 <wsse:Username>%s</wsse:Username>
 <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wssusername-token-profile-1.0#PasswordText">%s</wsse:Password>
 </wsse:UsernameToken>
 </wsse:Security>
 </soap:Header>
 <soap:Body>
 <est:requestConsultarPosicaoEstoquePorCNESPrincipioAtivoPaginado>
 <est:cnes>%d</est:cnes>
 <est:principioAtivo>%s</est:principioAtivo>
 <est:paginacao>
 <pag:posicaoRegistroInicio>%d</pag:posicaoRegistroInicio>
 <pag:quantidadeRegistrosPorPagina>%d</pag:quantidadeRegistrosPorPagina>
 <pag:quantidadeRegistros>%d</pag:quantidadeRegistros>
 </est:paginacao>
 </est:requestConsultarPosicaoEstoquePorCNESPrincipioAtivoPaginado>
 </soap:Body>
</soap:Envelope>